# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

i = int (input('введите трехзначное число: '))
summa = 0
while i > 0:
    x = i % 10
    summa = summa + x
    i = i// 10
print(summa)