# По данному целому неотрицательному n вычислите
# значение n!. N! = 1 * 2 * 3 * … * N (произведение всех
# чисел от 1 до N) 0! = 1 Решить задачу используя цикл
# while
# Input: 5
# Output: 120

n = int(input('Введите числоЖ '))

fact = 1
	
while n > 1:
	fact *= n
	n -= 1
	
print(fact)



# num = int(input("Р’РІРµРґРёС‚Рµ С‡РёСЃР»Рѕ: "))+1
# 	flag = 1
# 	if num<0:
# 	    print("Р’РІРµРґРёС‚Рµ РїРѕР»РѕР¶РёС‚РµР»СЊРЅРѕРµ С‡РёСЃР»Рѕ")
# 	else:
# 	    if num == 1:
# 	        print("1")
# 	    else:
# 	        while num != 1:
# 	            flag *= num - 1
# 	            num-=1
		    
# num = int(input("Р’РІРµРґРёС‚Рµ С‡РёСЃР»Рѕ: "))+1
# 	flag = 1
# 	if num<0:
# 	    print("Р’РІРµРґРёС‚Рµ РїРѕР»РѕР¶РёС‚РµР»СЊРЅРѕРµ С‡РёСЃР»Рѕ")
# 	else:
# 	    while num != 1:
# 	        flag *= num - 1
# 	        num-=1
# 	print(flag)